pbo71/frdm_mcxn947_blank/svd/MCXN947cm33_core0.xml
          <register>
            <name>QDC_INDEX</name>
            <description>QDCouter_loop Input Connections</description>
            <addressOffset>0x368</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3F</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>INP</name>
                <description>QDC0 INDEX input connections</description>
                <bitOffset>0</bitOffset>
                <bitWidth>6</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>val0</name>
                    <description>PINT PIN_INT0 input is selected</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val1</name>
                    <description>PINT PIN_INT4 input is selected</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val2</name>
                    <description>SCT_OUT4 input is selected</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val3</name>
                    <description>SCT_OUT5 input is selected</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val4</name>
                    <description>SCT_OUT1 input is selected</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val5</name>
                    <description>CTIMER0_MAT3 input is selected</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val6</name>
                    <description>CTIMER1_MAT3 input is selected</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val7</name>
                    <description>CTIMER2_MAT3 input is selected</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val8</name>
                    <description>CTIMER1_MAT0 input is selected</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val9</name>
                    <description>CTIMER3_MAT0 input is selected</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val11</name>
                    <description>ARM_TXEV input is selected</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val12</name>
                    <description>PINT GPIO_INT_BMAT input is selected</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val13</name>
                    <description>ADC0_tcomp[0] input is selected</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val14</name>
                    <description>ADC0_tcomp[1] input is selected</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val15</name>
                    <description>ADC0_tcomp[2] input is selected</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val16</name>
                    <description>ADC0_tcomp[3] input is selected</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val17</name>
                    <description>ADC1_tcomp[0] input is selected</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val18</name>
                    <description>ADC1_tcomp[1] input is selected</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val19</name>
                    <description>ADC1_tcomp[2] input is selected</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val20</name>
                    <description>ADC1_tcomp[3] input is selected</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val21</name>
                    <description>CMP0_OUT input is selected</description>
                    <value>0x15</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val22</name>
                    <description>CMP1_OUT input is selected</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val23</name>
                    <description>CMP2_OUT input is selected</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val24</name>
                    <description>PWM1_SM0_MUX_TRIG0 input is selected</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val25</name>
                    <description>PWM1_SM0_MUX_TRIG1 input is selected</description>
                    <value>0x19</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val26</name>
                    <description>PWM1_SM1_MUX_TRIG0 input is selected</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val27</name>
                    <description>PWM1_SM1_MUX_TRIG1 input is selected</description>
                    <value>0x1B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val28</name>
                    <description>PWM1_SM2_MUX_TRIG0 input is selected</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val29</name>
                    <description>PWM1_SM2_MUX_TRIG1 input is selected</description>
                    <value>0x1D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val30</name>
                    <description>PWM1_SM3_MUX_TRIG0 input is selected</description>
                    <value>0x1E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val31</name>
                    <description>PWM1_SM3_MUX_TRIG1 input is selected</description>
                    <value>0x1F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val32</name>
                    <description>QDC0_CMP/POS_MATCH input is selected</description>
                    <value>0x20</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val33</name>
                    <description>QDC1_CMP/POS_MATCH input is selected</description>
                    <value>0x21</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val34</name>
                    <description>EVTG_OUT0A input is selected</description>
                    <value>0x22</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val35</name>
                    <description>EVTG_OUT0B input is selected</description>
                    <value>0x23</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val36</name>
                    <description>EVTG_OUT1A input is selected</description>
                    <value>0x24</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val37</name>
                    <description>EVTG_OUT1B input is selected</description>
                    <value>0x25</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val38</name>
                    <description>EVTG_OUT2A input is selected</description>
                    <value>0x26</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val39</name>
                    <description>EVTG_OUT2B input is selected</description>
                    <value>0x27</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val40</name>
                    <description>EVTG_OUT3A input is selected</description>
                    <value>0x28</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val41</name>
                    <description>EVTG_OUT3B input is selected</description>
                    <value>0x29</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val42</name>
                    <description>TRIG_IN0 input is selected</description>
                    <value>0x2A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val43</name>
                    <description>TRIG_IN1 input is selected</description>
                    <value>0x2B</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val44</name>
                    <description>TRIG_IN2 input is selected</description>
                    <value>0x2C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val45</name>
                    <description>TRIG_IN3 input is selected</description>
                    <value>0x2D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val46</name>
                    <description>TRIG_IN4 input is selected</description>
                    <value>0x2E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val47</name>
                    <description>TRIG_IN5 input is selected</description>
                    <value>0x2F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val48</name>
                    <description>TRIG_IN6 input is selected</description>
                    <value>0x30</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val49</name>
                    <description>TRIG_IN7 input is selected</description>
                    <value>0x31</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val50</name>
                    <description>TRIG_IN8 input is selected</description>
                    <value>0x32</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>val51</name>
                    <description>TRIG_IN9 input is selected</description>
                    <value>0x33</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
