pbo71/frdm_mcxn947_blank/svd/MCXN947cm33_core0.xml
        <register>
          <name>CONFIG_MUTUAL</name>
          <description>TSI CONFIG (TSI_CONFIG) for Mutual-Capacitor</description>
          <alternateGroup>MUTUAL</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>config_sf_cp</name>
                  <description>Self capacitance</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>config_mt_cp</name>
                  <description>Mutual capacitance</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_NMIRROR</name>
              <description>NMOS Current Mirror</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>m1</name>
                  <description>m = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m2</name>
                  <description>m = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m3</name>
                  <description>m = 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>m4</name>
                  <description>m = 4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORR</name>
              <description>PMOS Current Mirror on Right Side</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mp1</name>
                  <description>m = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mp2</name>
                  <description>m = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mp3</name>
                  <description>m = 3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mp4</name>
                  <description>m = 4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PMIRRORL</name>
              <description>PMOS Current Mirror on Left Side</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>mpl4</name>
                  <description>m = 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl8</name>
                  <description>m = 8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl12</name>
                  <description>m = 12</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl16</name>
                  <description>m = 16</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl20</name>
                  <description>m = 20</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl24</name>
                  <description>m = 24</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl28</name>
                  <description>m = 28</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>mpl32</name>
                  <description>m = 32</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEL_RX</name>
              <description>Mutual-Capacitance RX Channel Selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tsi_8</name>
                  <description>TSI[8]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_9</name>
                  <description>TSI[9]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_10</name>
                  <description>TSI[10]</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_11</name>
                  <description>TSI[11]</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_12</name>
                  <description>TSI[12]</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_13</name>
                  <description>TSI[13]</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_14</name>
                  <description>TSI[14]</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_15</name>
                  <description>TSI[15]</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_16</name>
                  <description>TSI[16]</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_17</name>
                  <description>TSI[17]</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_18</name>
                  <description>TSI[18]</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_19</name>
                  <description>TSI[19]</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_20</name>
                  <description>TSI[20]</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_21</name>
                  <description>TSI[21]</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_22</name>
                  <description>TSI[22]</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_23</name>
                  <description>TSI[23]</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_24</name>
                  <description>TSI[24]</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEL_TX</name>
              <description>Mutual-Capacitance TX Channel Selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>tsi_tx_0</name>
                  <description>TSI[0]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_1</name>
                  <description>TSI[1]</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_2</name>
                  <description>TSI[2]</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_3</name>
                  <description>TSI[3]</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_4</name>
                  <description>TSI[4]</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_5</name>
                  <description>TSI[5]</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_6</name>
                  <description>TSI[6]</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tsi_tx_7</name>
                  <description>TSI[7]</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_CNT_EN</name>
              <description>Mutual-Capacitance Counter Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_TX_PD_EN</name>
              <description>Mutual-Capacitance TX Pulldown Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disables</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enables</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_SEN_BOOST</name>
              <description>Mutual-Capacitance Sensitivity Boost</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>bst_0</name>
                  <description>0 uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_2</name>
                  <description>2 uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_4</name>
                  <description>4 uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_6</name>
                  <description>6 uA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_8</name>
                  <description>8 uA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_10</name>
                  <description>10 uA</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_12</name>
                  <description>12 uA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_14</name>
                  <description>14 uA</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>bst_2n</name>
                  <description>2 * n uA</description>
                  <value>#1xxxx</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PRE_RES</name>
              <description>Mutual-Capacitance Precharge Resistor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>res_1</name>
                  <description>1 k</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_2</name>
                  <description>2 k</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_3</name>
                  <description>3 k</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_4</name>
                  <description>4 k</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_5</name>
                  <description>5 k</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_6</name>
                  <description>6 k</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_7</name>
                  <description>7 k</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>res_8</name>
                  <description>8 k</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M_PRE_CURRENT</name>
              <description>Mutual-Capacitance Precharge Current</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cur_1</name>
                  <description>1 uA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_2</name>
                  <description>2 uA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_3</name>
                  <description>3 uA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_4</name>
                  <description>4 uA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_5</name>
                  <description>5 uA</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_6</name>
                  <description>6 uA</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_7</name>
                  <description>7 uA</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>cur_8</name>
                  <description>8 uA</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TSHD</name>
          <description>TSI Threshold</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THRESL</name>
              <description>TSI Wakeup Channel Low Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>THRESH</name>
              <description>TSI Wakeup Channel High Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
