pbo71/frdm_mcxn947_blank/svd/MCXN947cm33_core0.xml
        <register>
          <name>PORTSC1</name>
          <description>Port Status &amp; Control</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1C000004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCS</name>
              <description>Current Connect Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>In Host mode: No device is present. In Device mode: Not attached</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>In Host mode: Device is present on port. In Device mode: Attached</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSC</name>
              <description>Connect Status Change</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Change in current connect status</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PE</name>
              <description>Port Enabled/Disabled</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEC</name>
              <description>Port Enable/Disable Change</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No change</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Port enabled/disabled status has changed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCA</name>
              <description>Over-Current Active</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_OVERCURRENT</name>
                  <description>This port does not have an over-current condition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERCURRENT</name>
                  <description>This port currently has an over-current condition</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCC</name>
              <description>Over-current Change</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FPR</name>
              <description>Force Port Resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No resume (K-state) detected/driven on port</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Resume detected/driven on port</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Port not in suspend state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Port in suspend state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PR</name>
              <description>Port Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Port is not in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Port is in reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSP</name>
              <description>High-Speed Port</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LS</name>
              <description>Line Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>SE0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K_STATE</name>
                  <description>K-state</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>J_STATE</name>
                  <description>J-state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PP</name>
              <description>Port Power</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PO</name>
              <description>Port Owner</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIC</name>
              <description>Port Indicator Control</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PORT_INDICATOR_OFF</name>
                  <description>Port indicators are off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_IND_AMBER</name>
                  <description>Amber</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORT_IND_GREEN</name>
                  <description>Green</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTC</name>
              <description>Port Test Control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TST_MODE_DIS</name>
                  <description>TEST_MODE_DISABLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>J_STATE</name>
                  <description>J_STATE</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>K_STATE</name>
                  <description>K_STATE</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>SE0 (host) / NAK (device)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCKT</name>
                  <description>Packet</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HS</name>
                  <description>FORCE_ENABLE_HS</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FS</name>
                  <description>FORCE_ENABLE_FS</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>FORCE_ENABLE_LS</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WKCN</name>
              <description>Wake on Connect Enable (WKCNNT_E)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKDC</name>
              <description>Wake on Disconnect Enable (WKDSCNNT_E)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKOC</name>
              <description>Wake on Over-current Enable (WKOC_E)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHCD</name>
              <description>PHY Low Power Suspend - Clock Disable (PLPSCD)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PHY_CLK_EN</name>
                  <description>Enable PHY clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PHY_CLK_DIS</name>
                  <description>Disable PHY clock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFSC</name>
              <description>Port Force Full Speed Connect</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL_SPEED</name>
                  <description>Forced to full speed</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTS_2</name>
              <description>Parallel Transceiver Select</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSPD</name>
              <description>Port Speed</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FS</name>
                  <description>Full Speed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LS</name>
                  <description>Low Speed</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HS</name>
                  <description>High Speed</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNDEFINED</name>
                  <description>Undefined</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTW</name>
              <description>Parallel Transceiver Width - Read/Write</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UTMI_8</name>
                  <description>Select the 8-bit UTMI interface [60 MHz]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UTMI_16</name>
                  <description>Select the 16-bit UTMI interface [30 MHz]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STS</name>
              <description>Serial Transceiver Select</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Parallel Interface signals is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Serial Interface Engine is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTS_1</name>
              <description>Parallel Transceiver Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
